       IDENTIFICATION DIVISION.
       PROGRAM-ID. AOC-2016-D6P1.

       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 
           SELECT INPUTFILE ASSIGN TO 'TEST'
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION. 
       FILE SECTION. 
       FD INPUTFILE IS EXTERNAL
           RECORD IS VARYING IN SIZE
           DATA RECORD IS INPUT-LINE.
       01 INPUT-LINE   PIC A(8).

       WORKING-STORAGE SECTION. 
       01  LOOP     PIC 9       VALUE 1.
       01  LTR      PIC 99      VALUE 00.
       01  OFFSET   PIC 9(9).
       01  FREQS    PIC 999     OCCURS 26 TIMES   VALUE 000.
       01  MESG     PIC A(8).
       01  LEN      PIC 9.
       01  PSN      PIC 9       VALUE 1.

       PROCEDURE DIVISION.
       MAIN.
           MOVE FUNCTION ORD('a') TO OFFSET.
           SUBTRACT 1 FROM OFFSET.
           OPEN INPUT INPUTFILE.
           PERFORM UNTIL LOOP = 0
              READ INPUTFILE NEXT RECORD INTO INPUT-LINE
              AT END
                 MOVE 0 TO LOOP
              NOT AT END
                 PERFORM GET-FREQ
              END-READ
           END-PERFORM
           CLOSE INPUTFILE.
           PERFORM GET-MESG.
           GOBACK.

       GET-FREQ.
           MOVE 0 TO LEN
           INSPECT INPUT-LINE TALLYING LEN FOR CHARACTERS BEFORE SPACE
           PERFORM VARYING PSN FROM 1 BY 1 UNTIL PSN > LEN
              SUBTRACT OFFSET FROM FUNCTION ORD(INPUT-LINE(PSN:1))
                 GIVING LTR
              ADD 1 TO FREQS(LTR)
           END-PERFORM.

       GET-MESG.
           PERFORM VARYING LTR FROM 1 BY 1 UNTIL LTR > 26
              
           END-PERFORM.

       END PROGRAM AOC-2016-D6P1.
