000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D6P2.
000300
000400 ENVIRONMENT DIVISION. 
000500 INPUT-OUTPUT SECTION. 
000600 FILE-CONTROL. 
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION. 
001100 FILE SECTION. 
001200 FD INPUTFILE IS EXTERNAL
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE   PIC A(8).
001600
001700 WORKING-STORAGE SECTION. 
001800 01 LOOP         PIC 9    VALUE 1.
001900 01 CLM          PIC 9    VALUE 0.
002000 01 LTR          PIC 99   VALUE 00.
002100 01 OFFSET       PIC 9(9).
002200 01 FREQS OCCURS 8 TIMES.
002300    05 FREQ-MAP OCCURS 26 TIMES.
002400       10 LTRS   PIC A.
002500       10 FREQ   PIC 999.
002600 01 MESG         PIC A(8).
002700 01 LEN          PIC 9.
002800 01 PSN          PIC 9    VALUE 1.
002900
003000 PROCEDURE DIVISION.
003100 MAIN.
003200     MOVE FUNCTION ORD('a') TO OFFSET.
003300     SUBTRACT 1 FROM OFFSET.
003400     OPEN INPUT INPUTFILE.
003500     PERFORM RESET-MAP
003600     PERFORM UNTIL LOOP = 0
003700             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003800             AT END
003900                MOVE 0 TO LOOP
004000             NOT AT END
004100                 PERFORM GET-FREQ
004200             END-READ
004300     END-PERFORM
004400     CLOSE INPUTFILE.
004500     PERFORM GET-MESG.
004600     DISPLAY MESG
004700     GOBACK.
004800
004900 RESET-MAP.
005000     PERFORM VARYING CLM FROM 1 BY 1 UNTIL CLM > 8 
005100             PERFORM VARYING LTR FROM 1 BY 1 UNTIL LTR > 26
005200                     MOVE 0 TO FREQ(CLM LTR)
005300                     MOVE FUNCTION CHAR(OFFSET + LTR) TO LTRS
005400                        (CLM LTR)
005500             END-PERFORM
005600     END-PERFORM.
005700
005800 GET-FREQ.
005900     MOVE 0 TO LEN
006000     INSPECT INPUT-LINE TALLYING LEN FOR CHARACTERS BEFORE SPACE
006100     PERFORM VARYING PSN FROM 1 BY 1 UNTIL PSN > LEN
006200             SUBTRACT OFFSET FROM FUNCTION ORD(INPUT-LINE(PSN:1))
006300                GIVING LTR
006400             ADD 1 TO FREQ(PSN LTR)
006500     END-PERFORM.
006600
006700 GET-MESG.
006800     PERFORM VARYING CLM FROM 1 BY 1 UNTIL CLM > LEN
006900             SORT FREQ-MAP(CLM) ASCENDING FREQ
007000             MOVE 1 TO LTR
007100             PERFORM UNTIL FREQ(CLM LTR) > 0
007200                     ADD 1 TO LTR
007300             END-PERFORM
007400             MOVE LTRS(CLM LTR) TO MESG(CLM:1)
007500     END-PERFORM.
007600
007700 END PROGRAM AOC-2016-D6P2.