000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. AOC-2016-D7P1.
000300
000400 ENVIRONMENT DIVISION. 
000500 INPUT-OUTPUT SECTION. 
000600 FILE-CONTROL. 
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION. 
001100 FILE SECTION. 
001200 FD INPUTFILE IS EXTERNAL 
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE   PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 LOOP   PIC 9    VALUE 1.
001900 01 LEN    PIC 999  VALUE 0.
002000 01 PSN    PIC 999  VALUE 0.
002100 01 B-LEN  PIC 999  VALUE 0.
002200 01 HNET   PIC 9    VALUE 0.
002300 01 CNT    PIC 999  VALUE 0.
002400 01 ABBA   PIC 9    VALUE 0.
002500
002600 PROCEDURE DIVISION.
002700 MAIN.
002800     OPEN INPUT INPUTFILE.
002900     PERFORM UNTIL LOOP = 0
003000        READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003100        AT END
003200           MOVE 0 TO LOOP
003300        NOT AT END
003400           PERFORM PARSE-LINE
003500        END-READ
003600     END-PERFORM
003700     CLOSE INPUTFILE.
003800     DISPLAY CNT
003900     GOBACK.
004000
004100 PARSE-LINE.
004200     MOVE 0 TO LEN
004300     INSPECT INPUT-LINE TALLYING LEN FOR CHARACTERS BEFORE SPACE
004400     SUBTRACT 3 FROM LEN
004500     MOVE 0 TO ABBA
004600     PERFORM VARYING PSN FROM 1 BY 1 UNTIL PSN > LEN
004700        IF INPUT-LINE(PSN:1) IS EQUAL TO '[' THEN
004800           MOVE 1 TO HNET
004900        ELSE IF INPUT-LINE(PSN:1) IS EQUAL TO ']' THEN
005000           MOVE 0 TO HNET
005100        ELSE
005200*          compare char 1 && 4
005300*          compare char 2 && 3
005400*          compare char 1 && 2
005500           IF INPUT-LINE(PSN:1) = INPUT-LINE(PSN + 3:1) AND
005600              INPUT-LINE(PSN + 1:1) = INPUT-LINE(PSN + 2:1) AND
005700              INPUT-LINE(PSN:1) NOT = INPUT-LINE(PSN + 1:1) THEN
005800           
005900*          check if a hypernet
006000              IF HNET = 0 THEN
006100                 MOVE 1 TO ABBA
006200              ELSE IF HNET = 1 THEN
006300                 MOVE 0 TO ABBA
006400                 EXIT PERFORM 
006500              END-IF
006600           END-IF
006700        END-IF
006800     END-PERFORM
006900
007000     IF ABBA = 1 THEN
007100        ADD 1 TO CNT
007200     END-IF.
007300
007400 END PROGRAM AOC-2016-D7P1.
