000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D3P1.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL 
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 LOOP        PIC 9      VALUE 1.
001900 01 FILL        PIC XXX.
002000 01 SIDE-A      PIC 999.
002100 01 SIDE-B      PIC 999.
002200 01 SIDE-C      PIC 999.
002300 01 POSSIBLE    PIC 999    VALUE 000.
002400
002500 PROCEDURE DIVISION.
002600 MAIN.
002700     OPEN INPUT INPUTFILE.
002800     PERFORM UNTIL LOOP = 0
002900             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003000             AT END
003100                MOVE 0 TO LOOP
003200             NOT AT END
003300                 PERFORM PARSE-SIDES
003400             END-READ
003500     END-PERFORM.
003600     CLOSE INPUTFILE.
003700     DISPLAY POSSIBLE
003800     GOBACK.
003900
004000 PARSE-SIDES.
004100     UNSTRING INPUT-LINE DELIMITED BY ALL SPACES
004200        INTO FILL
004300             SIDE-A
004400             SIDE-B
004500             SIDE-C
004600     END-UNSTRING.
004700
004800     IF SIDE-A + SIDE-B IS GREATER THAN SIDE-C AND
004900        SIDE-A + SIDE-C IS GREATER THAN SIDE-B AND
005000        SIDE-B + SIDE-C IS GREATER THAN SIDE-A THEN
005100        ADD 1 TO POSSIBLE
005200     END-IF.
005300
005400 END PROGRAM AOC-2016-D3P1.
