000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D3P1.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL 
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 LOOP        PIC 9      VALUE 1.
001900 01 FILL        PIC XXX.
002000 01 SIDE-A      PIC 999.
002100 01 SIDE-B      PIC 999.
002200 01 SIDE-C      PIC 999.
002300 01 POSSIBLE    PIC 999    VALUE 000.
002400 01 TWO-SIDES   PIC 9999.
002500
002600 PROCEDURE DIVISION.
002700 MAIN.
002800     OPEN INPUT INPUTFILE.
002900     PERFORM UNTIL LOOP = 0
003000             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003100             AT END
003200                MOVE 0 TO LOOP
003300             NOT AT END
003400                 PERFORM PARSE-SIDES
003500             END-READ
003600     END-PERFORM.
003700     CLOSE INPUTFILE.
003800     DISPLAY POSSIBLE
003900     GOBACK.
004000
004100 PARSE-SIDES.
004200     UNSTRING INPUT-LINE DELIMITED BY ALL SPACES
004300        INTO FILL
004400             SIDE-A
004500             SIDE-B
004600             SIDE-C
004700     END-UNSTRING.
004800
004900     IF SIDE-A + SIDE-B IS GREATER THAN SIDE-C AND
005000        SIDE-A + SIDE-C IS GREATER THAN SIDE-B AND
005100        SIDE-B + SIDE-C IS GREATER THAN SIDE-A THEN
005200        ADD 1 TO POSSIBLE
005300     END-IF.
005400
005500 END PROGRAM AOC-2016-D3P1.
