000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D3P2.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL 
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 LOOP        PIC 9      VALUE 1.
001900 01 FILL        PIC XXX.
002000 01 POSSIBLE    PIC 9999   VALUE 0000.
002100 01 INDX        PIC 9.
002200 01 TRI-A       PIC 999 OCCURS 3 TIMES.
002300 01 TRI-B       PIC 999 OCCURS 3 TIMES.
002400 01 TRI-C       PIC 999 OCCURS 3 TIMES.
002500
002600 PROCEDURE DIVISION.
002700 MAIN.
002800     OPEN INPUT INPUTFILE.
002900     PERFORM UNTIL LOOP = 0
003000             MOVE 1 TO INDX
003100             PERFORM UNTIL INDX = 4 OR LOOP = 0
003200                     READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003300                     AT END
003400                        MOVE 0 TO LOOP
003500                     NOT AT END
003600                         PERFORM PARSE-COLUMNS
003700                         ADD 1 TO INDX
003800                     END-READ
003900             END-PERFORM
004000
004100             IF LOOP IS NOT EQUAL TO 0 THEN
004200                PERFORM PARSE-SIDES
004300             END-IF
004400     END-PERFORM.
004500     CLOSE INPUTFILE.
004600     DISPLAY POSSIBLE
004700     GOBACK.
004800
004900 PARSE-COLUMNS.
005000     UNSTRING INPUT-LINE DELIMITED BY ALL SPACES
005100        INTO FILL
005200             TRI-A(INDX)
005300             TRI-B(INDX)
005400             TRI-C(INDX)
005500     END-UNSTRING.
005600     
005700
005800 PARSE-SIDES.
005900     IF TRI-A(1) + TRI-A(2) > TRI-A(3) AND
006000        TRI-A(1) + TRI-A(3) > TRI-A(2) AND
006100        TRI-A(2) + TRI-A(3) > TRI-A(1) THEN
006200        ADD 1 TO POSSIBLE
006300     END-IF 
006400
006500     IF TRI-B(1) + TRI-B(2) > TRI-B(3) AND
006600        TRI-B(1) + TRI-B(3) > TRI-B(2) AND
006700        TRI-B(2) + TRI-B(3) > TRI-B(1) THEN
006800        ADD 1 TO POSSIBLE
006900     END-IF
007000
007100     IF TRI-C(1) + TRI-C(2) > TRI-C(3) AND
007200        TRI-C(1) + TRI-C(3) > TRI-C(2) AND
007300        TRI-C(2) + TRI-C(3) > TRI-C(1) THEN
007400        ADD 1 TO POSSIBLE
007500     END-IF.
007600
007700
007800 END PROGRAM AOC-2016-D3P2.
