000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D1P1.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'input.txt'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE PIC A(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 INDX PIC 999 VALUE 001.
001900 01 OFFSET PIC 9.
002000 01 DIR PIC A.
002100 01 DIST PIC 999.
002200 01 LOOP PIC 9 VALUE 1.
002300
002400 01 X PIC S999 VALUE +000.
002500 01 Y PIC S999 VALUE +000.
002600 01 TOTAL-DIST PIC 999.
002700 01 FACING PIC 9 VALUE 1.
002800
002900 PROCEDURE DIVISION.
003000 MAIN.
003100     OPEN INPUT INPUTFILE.
003200     READ INPUTFILE.
003300     CLOSE INPUTFILE.
003400
003500     PERFORM UNTIL LOOP = 0
003600     PERFORM PARSE-INPUT
003800     END-PERFORM.
003900
004000     MOVE FUNCTION ABS(X) TO X.
004100     MOVE FUNCTION ABS(Y) TO Y.
004200     ADD X TO Y GIVING TOTAL-DIST.
004300     DISPLAY TOTAL-DIST.
004400
004500 PARSE-INPUT.
004600     MOVE INPUT-LINE(INDX:1) TO    DIR.
004700     IF DIR <> "R" AND DIR <> "L" THEN
004800        MOVE 0 TO LOOP
004900     END-IF.
005000
005100     ADD 1 TO INDX.
005200     MOVE 0 TO OFFSET.
005300     PERFORM UNTIL INPUT-LINE(INDX + OFFSET:1) = "," OR
005400                   INPUT-LINE(INDX + OFFSET:1) = " "
005500        ADD 1 TO OFFSET
005600     END-PERFORM.
005700
005900     MOVE INPUT-LINE(INDX:OFFSET) TO DIST.
006000     ADD OFFSET TO INDX.
006100     ADD 2 TO INDX.

006500     IF DIR = "R" THEN
006600        ADD 1 TO FACING
006700     ELSE
006800        SUBTRACT 1 FROM FACING
006900     END-IF.
007000
007100     IF FACING = 5 THEN
007200        MOVE 1 TO FACING
007300     ELSE IF FACING = 0 THEN
007400        MOVE 4 TO FACING
007500     END-IF.
007600
007700     PERFORM DIST TIMES
007800     EVALUATE FACING
007900        WHEN 1
008000           ADD 1 TO Y
008100        WHEN 2
008200           ADD 1 TO X
008300        WHEN 3
008400           SUBTRACT 1 FROM Y
008500        WHEN 4
008600           SUBTRACT 1 FROM X
008700     END-EVALUATE
008800     END-PERFORM.
009100
009200 END PROGRAM AOC-2016-D1P1.
