000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D1P2.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'input.txt'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC A(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 INDX        PIC 999    VALUE 001.
001900 01 OFFSET      PIC 9.
002000 01 DIR         PIC A.
002100 01 DIST        PIC 999.
002200 01 LOOP        PIC 9      VALUE 1.
002300
002400 01 X           PIC S999   VALUE +000.
002500 01 Y           PIC S999   VALUE +000.
002600 01 TOTAL-DIST  PIC 999.
002700 01 FACING      PIC 9      VALUE 1.
002800
002900 01 VISITED.
003000    05 ROW OCCURS 5000 TIMES.
003100       10 CLM   PIC 9      VALUE 0 OCCURS 5000 TIMES.
003200
003300 PROCEDURE DIVISION.
003400 MAIN.
003500     OPEN INPUT INPUTFILE.
003600     READ INPUTFILE.
003700     CLOSE INPUTFILE.
003800
003900     PERFORM UNTIL LOOP = 0
004000             PERFORM PARSE-INPUT
004100     END-PERFORM.
004200
004300     MOVE FUNCTION ABS(X) TO X.
004400     MOVE FUNCTION ABS(Y) TO Y.
004500     ADD X TO Y GIVING TOTAL-DIST.
004600     DISPLAY TOTAL-DIST.
004700
004800 PARSE-INPUT.
004900     MOVE INPUT-LINE(INDX:1) TO DIR.
005000     IF DIR IS NOT EQUAL TO "R" AND DIR IS NOT EQUAL TO "L" THEN
005100        MOVE 0 TO LOOP
005200     END-IF.
005300
005400     ADD 1 TO INDX.
005500     MOVE 0 TO OFFSET.
005600     PERFORM UNTIL INPUT-LINE(INDX + OFFSET:1) = "," OR
005700        INPUT-LINE(INDX + OFFSET:1) = " "
005800             ADD 1 TO OFFSET
005900     END-PERFORM.
006000
006100     MOVE INPUT-LINE(INDX:OFFSET) TO DIST.
006200     ADD OFFSET TO INDX.
006300     ADD 2 TO INDX.
006400
006500     IF DIR = "R" THEN
006600        ADD 1 TO FACING
006700     ELSE
006800        SUBTRACT 1 FROM FACING
006900     END-IF.
007000
007100     IF FACING = 5 THEN
007200        MOVE 1 TO FACING
007300     ELSE
007400        IF FACING = 0 THEN
007500           MOVE 4 TO FACING
007600        END-IF.
007700
007800     PERFORM UNTIL DIST = 0
007900             EVALUATE FACING
008000             WHEN 1
008100                  ADD 1 TO Y
008200             WHEN 2
008300                  ADD 1 TO X
008400             WHEN 3
008500                  SUBTRACT 1 FROM Y
008600             WHEN 4
008700                  SUBTRACT 1 FROM X
008800             END-EVALUATE 
008900
009000             IF CLM(X + 100, Y + 100) = 1 THEN
009100                MOVE 0 TO LOOP
009200                MOVE 0 TO DIST
009300             ELSE
009400                MOVE 1 TO CLM(X + 100, Y + 100)
009500                SUBTRACT 1 FROM DIST
009600     END-PERFORM.
009700
009800 END PROGRAM AOC-2016-D1P2.
