000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D2P1.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 OFFSET      PIC 999.
001900 01 LEN         PIC 999.
002000 01 LOOP        PIC 9      VALUE 1.
002100 01 X           PIC 9      VALUE 2.
002200 01 Y           PIC 9      VALUE 2.
002300 01 KEYPAD.
002400    05 ROW OCCURS 3 TIMES.
002500       10 CLM   PIC X OCCURS 3 TIMES.
002600
002700 PROCEDURE DIVISION.
002800 MAIN.
002900     MOVE '123' TO ROW(1)
003000     MOVE '456' TO ROW(2)
003100     MOVE '789' TO ROW(3)
003200
003300     OPEN INPUT INPUTFILE.
003400     PERFORM UNTIL LOOP = 0
003500             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003600             AT END
003700                MOVE 0 TO LOOP
003800                DISPLAY ' '
003900             NOT AT END
004000                 PERFORM
004100                    PARSE-INPUT
004200                 DISPLAY CLM(Y, X) WITH NO ADVANCING 
004300             END-READ
004400     END-PERFORM.
004500     CLOSE INPUTFILE.
004600
004700     GOBACK.
004800
004900 PARSE-INPUT.
005000     MOVE 0 TO LEN
005100     MOVE 1 TO OFFSET
005200
005300     INSPECT INPUT-LINE TALLYING LEN FOR CHARACTERS BEFORE SPACE.
005400     PERFORM LEN TIMES
005500        
005600             EVALUATE INPUT-LINE(OFFSET:1)
005700             WHEN 'U'
005800                  SUBTRACT 1 FROM Y
005900             WHEN 'D'
006000                  ADD 1 TO Y
006100             WHEN 'L'
006200                  SUBTRACT 1 FROM X
006300             WHEN 'R'
006400                  ADD 1 TO X
006500             END-EVALUATE
006600
006700             ADD 1 TO OFFSET
006800
006900             IF Y < 1 THEN
007000                MOVE 1 TO Y
007100             ELSE
007200                IF Y > 3 THEN
007300                   MOVE 3 TO Y
007400                END-IF
007500             END-IF
007600
007700             IF X < 1 THEN
007800                MOVE 1 TO X
007900             ELSE
008000                IF X > 3 THEN
008100                   MOVE 3 TO X
008200                END-IF
008300             END-IF
008400     END-PERFORM.
008500     
008600 END PROGRAM AOC-2016-D2P1.
