000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D2P1.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 INDX        PIC 999    VALUE 001.
001900 01 OFFSET      PIC 999.
002000 01 LEN         PIC 999.
002100 01 LOOP        PIC 9      VALUE 1.
002200 01 X           PIC 9      VALUE 1.
002300 01 Y           PIC 9      VALUE 3.
002400 01 KEYPAD.
002500    05 ROW OCCURS 5 TIMES.
002600       10 CLM   PIC X OCCURS 5 TIMES.
002700
002800 PROCEDURE DIVISION.
002900 MAIN.
003000     MOVE '  1  ' TO ROW(1)
003100     MOVE ' 234 ' TO ROW(2)
003200     MOVE '56789' TO ROW(3)
003300     MOVE ' ABC ' TO ROW(4)
003400     MOVE '  D  ' TO ROW(5)
003500
003600     OPEN INPUT INPUTFILE.
003700     PERFORM UNTIL LOOP = 0
003800             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003900             AT END
004000                MOVE 0 TO LOOP
004100                DISPLAY ' '
004200             NOT AT END
004300                 PERFORM
004400                    PARSE-INPUT
004500                 DISPLAY CLM(Y, X) WITH NO ADVANCING 
004600             END-READ
004700     END-PERFORM.
004800     CLOSE INPUTFILE.
004900
005000     GOBACK.
005100
005200 PARSE-INPUT.
005300     MOVE 0 TO LEN
005400     MOVE 1 TO OFFSET
005500
005600     INSPECT INPUT-LINE TALLYING LEN FOR CHARACTERS BEFORE SPACE.
005700     PERFORM LEN TIMES
005800             EVALUATE INPUT-LINE(OFFSET:1)
005900             WHEN 'U'
006000                  IF Y IS NOT EQUAL TO 1 AND
006100                     CLM(Y - 1, X) IS NOT EQUAL TO ' ' THEN
006200                     SUBTRACT 1 FROM Y
006300                  END-IF
006400             WHEN 'D'
006500                  IF Y IS NOT EQUAL TO 5 AND
006600                     CLM(Y + 1, X) IS NOT EQUAL TO ' ' THEN
006700                     ADD 1 TO Y
006800                  END-IF
006900             WHEN 'L'
007000                  IF X IS NOT EQUAL TO 1 AND
007100                     CLM(Y, X - 1) IS NOT EQUAL TO ' ' THEN
007200                     SUBTRACT 1 FROM X
007300                  END-IF
007400             WHEN 'R'
007500                  IF X IS NOT EQUAL TO 5 AND
007600                     CLM(Y, X + 1) IS NOT EQUAL TO ' ' THEN
007700                     ADD 1 TO X
007800                  END-IF
007900             END-EVALUATE
008000
008100             ADD 1 TO OFFSET
008200     END-PERFORM.
008300     
008400 END PROGRAM AOC-2016-D2P1.
