000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D2P2.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD INPUTFILE IS EXTERNAL
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE  PIC X(999).
001600
001700 WORKING-STORAGE SECTION.
001800 01 OFFSET      PIC 999.
001900 01 LEN         PIC 999.
002000 01 LOOP        PIC 9      VALUE 1.
002100 01 X           PIC 9      VALUE 1.
002200 01 Y           PIC 9      VALUE 3.
002300 01 KEYPAD.
002400    05 ROW OCCURS 5 TIMES.
002500       10 CLM   PIC X OCCURS 5 TIMES.
002600
002700 PROCEDURE DIVISION.
002800 MAIN.
002900     MOVE '  1  ' TO ROW(1)
003000     MOVE ' 234 ' TO ROW(2)
003100     MOVE '56789' TO ROW(3)
003200     MOVE ' ABC ' TO ROW(4)
003300     MOVE '  D  ' TO ROW(5)
003400
003500     OPEN INPUT INPUTFILE.
003600     PERFORM UNTIL LOOP = 0
003700             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003800             AT END
003900                MOVE 0 TO LOOP
004000                DISPLAY ' '
004100             NOT AT END
004200                 PERFORM
004300                    PARSE-INPUT
004400                 DISPLAY CLM(Y, X) WITH NO ADVANCING 
004500             END-READ
004600     END-PERFORM.
004700     CLOSE INPUTFILE.
004800
004900     GOBACK.
005000
005100 PARSE-INPUT.
005200     MOVE 0 TO LEN
005300     MOVE 1 TO OFFSET
005400
005500     INSPECT INPUT-LINE TALLYING LEN FOR CHARACTERS BEFORE SPACE.
005600     PERFORM LEN TIMES
005700             EVALUATE INPUT-LINE(OFFSET:1)
005800             WHEN 'U'
005900                  IF Y IS NOT EQUAL TO 1 AND
006000                     CLM(Y - 1, X) IS NOT EQUAL TO ' ' THEN
006100                     SUBTRACT 1 FROM Y
006200                  END-IF
006300             WHEN 'D'
006400                  IF Y IS NOT EQUAL TO 5 AND
006500                     CLM(Y + 1, X) IS NOT EQUAL TO ' ' THEN
006600                     ADD 1 TO Y
006700                  END-IF
006800             WHEN 'L'
006900                  IF X IS NOT EQUAL TO 1 AND
007000                     CLM(Y, X - 1) IS NOT EQUAL TO ' ' THEN
007100                     SUBTRACT 1 FROM X
007200                  END-IF
007300             WHEN 'R'
007400                  IF X IS NOT EQUAL TO 5 AND
007500                     CLM(Y, X + 1) IS NOT EQUAL TO ' ' THEN
007600                     ADD 1 TO X
007700                  END-IF
007800             END-EVALUATE
007900
008000             ADD 1 TO OFFSET
008100     END-PERFORM.
008200     
008300 END PROGRAM AOC-2016-D2P2.
