000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D4P1.
000300
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION.
001100 FILE SECTION. 
001200 FD INPUTFILE IS EXTERNAL 
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE   PIC X(999).
001600
001700 WORKING-STORAGE SECTION. 
001800 01 LOOP         PIC 9      VALUE 1.
001900 01 LOOP2        PIC 99     VALUE 1.
002000 01 LEN          PIC 999.
002100 01 LEN2         PIC 999.
002200 01 TEMP         PIC X(999).
002300 01 SECTOR-SUM   PIC 999999 VALUE 000000.
002400 01 ROOM-NAME    PIC A(99).
002500 01 SECTOR-ID    PIC 999.
002600 01 CHECKSUM     PIC AAAAA.
002700 01 FREQUENCIES.
002800    05 FREQ-MAP OCCURS 26 TIMES.
002900       10 LTRS   PIC A.
003000       10 FREQ   PIC 99.
003100 01 LETTERS      PIC A(26)  VALUE 'abcdefghijklmnopqrstuvwxyz'. 
003200
003300 PROCEDURE DIVISION.
003400 MAIN.
003500     OPEN INPUT INPUTFILE.
003600     PERFORM UNTIL LOOP = 0
003700             READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003800             AT END
003900                MOVE 0 TO LOOP
004000             NOT AT END
004100                 PERFORM PARSE-LINE
004200             END-READ
004300     END-PERFORM
004400     CLOSE INPUTFILE.
004500     DISPLAY SECTOR-SUM.
004600     GOBACK.
004700
004800 PARSE-LINE.
004900     MOVE 0 TO LEN
005000
005100*    FORMAT LINE
005200     MOVE FUNCTION REVERSE(INPUT-LINE) TO TEMP
005300     INSPECT TEMP REPLACING FIRST '-' BY ','
005400     MOVE FUNCTION REVERSE(TEMP) TO INPUT-LINE
005500
005600     INSPECT INPUT-LINE REPLACING ALL '[' BY ','
005700     INSPECT INPUT-LINE REPLACING ALL ']' BY SPACE
005800
005900*    SPLIT INTO PRIMARY SECTIONS
006000     UNSTRING INPUT-LINE DELIMITED BY ','
006100        INTO TEMP SECTOR-ID CHECKSUM
006200     END-UNSTRING
006300     
006400*    ISOLATE ROOM ID
006500     MOVE 0 TO LEN
006600     INSPECT TEMP TALLYING LEN FOR CHARACTERS BEFORE SPACE
006700
006800     MOVE ' ' TO ROOM-NAME
006900     PERFORM VARYING LEN2 FROM 1 BY 1 UNTIL LEN2 > LEN
007000             IF TEMP(LEN2:1) IS NOT EQUAL TO '-' THEN
007100                STRING ROOM-NAME TEMP(LEN2:1) DELIMITED BY SPACE
007200                   INTO ROOM-NAME
007300                END-STRING
007400             END-IF
007500     END-PERFORM
007600
007700*    MAP LETTERS TO FREQUENCY AND SORT
007800     MOVE 0 TO LEN
007900     INSPECT ROOM-NAME TALLYING LEN FOR CHARACTERS BEFORE SPACE
008000     PERFORM VARYING LOOP2 FROM 1 BY 1 UNTIL LOOP2 > 26
008100             MOVE 0 TO LEN2
008200             INSPECT ROOM-NAME(1:LEN) TALLYING LEN2
008300                FOR ALL LETTERS(LOOP2:1)
008400             MOVE LEN2 TO FREQ(LOOP2)
008500             MOVE LETTERS(LOOP2:1) TO LTRS(LOOP2)
008600     END-PERFORM
008700
008800     SORT FREQ-MAP DESCENDING FREQ.
008900
009000     IF LTRS(1) = CHECKSUM(1:1) AND
009100        LTRS(2) = CHECKSUM(2:1) AND
009200        LTRS(3) = CHECKSUM(3:1) AND
009300        LTRS(4) = CHECKSUM(4:1) AND
009400        LTRS(5) = CHECKSUM(5:1) THEN
009500        ADD SECTOR-ID TO SECTOR-SUM
009600     END-IF.
009700
009800 END PROGRAM AOC-2016-D4P1.
