000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. AOC-2016-D9P1.
000300
000400 ENVIRONMENT DIVISION. 
000500 INPUT-OUTPUT SECTION. 
000600 FILE-CONTROL. 
000700     SELECT INPUTFILE ASSIGN TO 'INPUT'
000800     ORGANIZATION IS LINE SEQUENTIAL.
000900
001000 DATA DIVISION. 
001100 FILE SECTION. 
001200 FD INPUTFILE IS EXTERNAL 
001300     RECORD IS VARYING IN SIZE
001400     DATA RECORD IS INPUT-LINE.
001500 01 INPUT-LINE   PIC X(99999).
001600
001700 WORKING-STORAGE SECTION. 
001800 01  LOOP     PIC 9          VALUE 1.
001900 01  LEN      PIC 9(5)       VALUE 0.
002000 01  TMP      PIC 99         VALUE 0.
002100 01  OFFSET   PIC 99         VALUE 0.
002200 01  PTR      PIC 9(5)       VALUE 0.
002300 01  PTR2     PIC 9(5)       VALUE 0.
002400 01  CHRS     PIC 9(5)       VALUE 0.
002500 01  REPS     PIC 9(5)       VALUE 0.
002600 01  MESG     PIC X(99999).
002700
002800 PROCEDURE DIVISION.
002900 MAIN.
003000     OPEN INPUT INPUTFILE.
003100     PERFORM UNTIL LOOP = 0
003200        READ INPUTFILE NEXT RECORD INTO INPUT-LINE
003300        AT END
003400           MOVE 0 TO LOOP
003500        NOT AT END
003600           PERFORM DECRYPT
003700           DISPLAY LENGTH OF FUNCTION TRIM(MESG)
003800        END-READ
003900     END-PERFORM
004000     CLOSE INPUTFILE
004100     GOBACK.
004200
004300 DECRYPT.
004400     MOVE 0 TO LEN
004500     INSPECT FUNCTION TRIM(INPUT-LINE)
004600        TALLYING LEN FOR CHARACTERS BEFORE SPACES
004700
004800     INSPECT MESG REPLACING CHARACTERS BY SPACE
004900
005000     MOVE 1 TO PTR
005100     MOVE 1 TO PTR2
005200     PERFORM UNTIL PTR > LEN
005300
005400        IF INPUT-LINE(PTR:1) IS EQUAL TO '(' THEN
005500*          MOVE NEXT X CHARACTERS Y TIMES TO MESG
005600*          JUMP PTR AHEAD AN APPROPRIATE AMOUNT
005700           MOVE 0 TO TMP
005800           MOVE 0 TO REPS
005900           INSPECT INPUT-LINE(PTR + 1:10) TALLYING TMP
006000              FOR CHARACTERS BEFORE INITIAL 'x'
006100
006200           INSPECT INPUT-LINE(PTR + TMP + 2:10) TALLYING REPS
006300              FOR CHARACTERS BEFORE INITIAL ')'
006400
006500           COMPUTE
006600              OFFSET = REPS + TMP + 3
006700           END-COMPUTE 
006800
006900           MOVE INPUT-LINE(PTR + 1:TMP) TO CHRS
007000           MOVE INPUT-LINE(PTR + TMP + 2:REPS) TO REPS
007100
007200           PERFORM VARYING TMP FROM 1 BY 1 UNTIL TMP > REPS
007300              MOVE INPUT-LINE(PTR + OFFSET:CHRS) TO 
007400                 MESG(PTR2:CHRS)
007500              ADD CHRS TO PTR2
007600           END-PERFORM
007700
007800           COMPUTE
007900              PTR = PTR + OFFSET + CHRS - 1
008000           END-COMPUTE
008100        ELSE
008200*          MOVE TO MESG
008300           MOVE INPUT-LINE(PTR:1) TO MESG(PTR2:1)
008400           ADD 1 TO PTR2
008500        END-IF
008600
008700        ADD 1 TO PTR
008800     END-PERFORM.
008900
009000 END PROGRAM AOC-2016-D9P1.
