000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D5P1.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 REPOSITORY.
000700     FUNCTION PIPE-OPEN
000800     FUNCTION PIPE-READ
000900     FUNCTION PIPE-CLOSE
001000     FUNCTION ALL INTRINSIC.
001100
001200 DATA DIVISION.
001300 WORKING-STORAGE SECTION.
001400 01  PIPE-LINE   PIC X(32768).
001500 01  PIPE-OUT    PIC X(32768).
001600
001700 01  READ-LENGTH PIC 9(5).
001800
001900 01  PIPE-COMMAND PIC X(64).
002000
002100 01  PIPE-RECORD.
002200     05 PIPE-POINTER   USAGE POINTER.
002300     05 PIPE-RETURN    USAGE BINARY-LONG.
002400
002500 01  PIPE-RECORD-OUT.
002600     05 PIPE-READ-STATUS USAGE POINTER.
002700        88 PIPE-GONE   VALUE NULL.
002800     05 PIPE-WRITE-STATUS USAGE BINARY-LONG.
002900 01  PIPE-STATUS USAGE BINARY-LONG.
003000
003100 01  LEN PIC 99 VALUE 00.
003200 01  EOF PIC X VALUE 'F'.
003300 
003400 01  PRE   PIC X(8) VALUE 'echo -n '.
003500 01  DOOR-ID PIC A(8) VALUE 'uqwqemis'.
003600 01  INDX PIC 9(8) VALUE 0.
003700 01  POST PIC X(9) VALUE ' | md5sum'.
003800 01  HASH PIC X(32).
003900 01  PSWD PIC X(8).
004000 01  CURR PIC 9 VALUE 1.
004100
004200 PROCEDURE DIVISION.
004300 MAIN.
004400     PERFORM GET-PASSWORD.
004500     DISPLAY PSWD.
004600
004700     GOBACK.
004800
004900 GET-PASSWORD.
005000     PERFORM UNTIL CURR > 8
005100        PERFORM MD5
005200        IF FUNCTION MOD(INDX, 1000) = 0 THEN
005300           DISPLAY INDX
005400        END-IF 
005500        IF HASH(1:5) IS EQUAL TO 00000 THEN
005600           DISPLAY INDX
005700           DISPLAY '    'CURR': 'HASH(6:1)
005800           MOVE HASH(6:1) TO PSWD(CURR:1)
005900           ADD 1 TO CURR
006000        END-IF
006100        ADD 1 TO INDX
006200     END-PERFORM.
006300
006400 MD5.
006500     MOVE 0 TO LEN
006600     INSPECT INDX TALLYING LEN FOR LEADING ZEROS.
006700     MOVE FUNCTION 
006800        CONCATENATE(PRE DOOR-ID INDX(LEN + 1:8 - LEN) POST) TO
006900        PIPE-COMMAND
007000     MOVE PIPE-OPEN(PIPE-COMMAND, "r") TO PIPE-RECORD
007100     IF PIPE-RETURN IS NOT EQUAL TO 255 THEN
007200        MOVE PIPE-READ(PIPE-RECORD, PIPE-LINE) TO PIPE-RECORD-OUT
007300        MOVE PIPE-CLOSE(PIPE-RECORD) TO PIPE-STATUS 
007400        IF PIPE-STATUS IS EQUAL TO ZERO THEN
007500           UNSTRING PIPE-LINE DELIMITED BY X"0A" INTO PIPE-LINE
007600              COUNT IN READ-LENGTH
007700           END-UNSTRING
007800           MOVE PIPE-LINE(1:READ-LENGTH) TO HASH
007900        ELSE
008000           DISPLAY "OOPS:" PIPE-STATUS UPON SYSERR
008100        END-IF
008200     END-IF.
008300
008400 END PROGRAM AOC-2016-D5P1.
