000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AOC-2016-D5P2.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 REPOSITORY.
000700     FUNCTION PIPE-OPEN
000800     FUNCTION PIPE-READ
000900     FUNCTION PIPE-CLOSE
001000     FUNCTION ALL INTRINSIC.
001100
001200 DATA DIVISION.
001300 WORKING-STORAGE SECTION.
001400 01  PIPE-LINE   PIC X(32768).
001500 01  PIPE-OUT    PIC X(32768).
001600
001700 01  READ-LENGTH PIC 9(5).
001800
001900 01  PIPE-COMMAND PIC X(64).
002000
002100 01  PIPE-RECORD.
002200     05 PIPE-POINTER   USAGE POINTER.
002300     05 PIPE-RETURN    USAGE BINARY-LONG.
002400
002500 01  PIPE-RECORD-OUT.
002600     05 PIPE-READ-STATUS USAGE POINTER.
002700        88 PIPE-GONE   VALUE NULL.
002800     05 PIPE-WRITE-STATUS USAGE BINARY-LONG.
002900 01  PIPE-STATUS USAGE BINARY-LONG.
003000
003100 01  LEN PIC 99 VALUE 00.
003200 01  EOF PIC X VALUE 'F'.
003300 
003400 01  PRE   PIC X(8) VALUE 'echo -n '.
003500 01  DOOR-ID PIC A(8) VALUE 'uqwqemis'.
003600 01  INDX PIC 9(8) VALUE 4515050.
003700 01  POST PIC X(9) VALUE ' | md5sum'.
003800 01  HASH PIC X(32).
003900 01  PSWD PIC X(8) VALUE '________'.
004000 01  PSN  PIC 9 VALUE 0.
004100 01  CURR PIC 9 VALUE 1.
004200
004300 PROCEDURE DIVISION.
004400 MAIN.
004500     PERFORM GET-PASSWORD.
004600     DISPLAY PSWD.
004700
004800     GOBACK.
004900
005000 GET-PASSWORD.
005100     PERFORM UNTIL CURR > 8
005200        PERFORM MD5
005300        IF FUNCTION MOD(INDX, 10000) = 0 THEN
005400           DISPLAY INDX
005500        END-IF 
005600        IF HASH(1:5) IS EQUAL TO 00000 THEN
005700           DISPLAY INDX
005800           DISPLAY '    'HASH
005900           
006000           IF HASH(6:1) IS NUMERIC THEN
006100              MOVE HASH(6:1) TO PSN
006200              ADD 1 TO PSN
006300              IF PSN IS LESS THAN OR EQUAL TO 8 AND
006400                 PSWD(PSN:1) IS EQUAL TO '_' THEN
006500                 
006600                 MOVE HASH(7:1) TO PSWD(PSN:1)
006700                 ADD 1 TO CURR
006800                 DISPLAY '    'PSWD
006900              ELSE
007000                 DISPLAY '    MISS: INVALID OR DUPLICATE POSITION'
007100              END-IF
007200           ELSE
007300              DISPLAY '    MISS: NON NUMERIC VALUE'
007400           END-IF
007500        END-IF
007600        ADD 1 TO INDX
007700     END-PERFORM.
007800
007900 MD5.
008000     MOVE 0 TO LEN
008100     INSPECT INDX TALLYING LEN FOR LEADING ZEROS.
008200     MOVE FUNCTION 
008300        CONCATENATE(PRE DOOR-ID INDX(LEN + 1:8 - LEN) POST) TO
008400        PIPE-COMMAND
008500     MOVE PIPE-OPEN(PIPE-COMMAND, "r") TO PIPE-RECORD
008600     IF PIPE-RETURN IS NOT EQUAL TO 255 THEN
008700        MOVE PIPE-READ(PIPE-RECORD, PIPE-LINE) TO PIPE-RECORD-OUT
008800        MOVE PIPE-CLOSE(PIPE-RECORD) TO PIPE-STATUS 
008900        IF PIPE-STATUS IS EQUAL TO ZERO THEN
009000           UNSTRING PIPE-LINE DELIMITED BY X"0A" INTO PIPE-LINE
009100              COUNT IN READ-LENGTH
009200           END-UNSTRING
009300           MOVE PIPE-LINE(1:READ-LENGTH) TO HASH
009400        ELSE
009500           DISPLAY "OOPS:" PIPE-STATUS UPON SYSERR
009600        END-IF
009700     END-IF.
009800
009900 END PROGRAM AOC-2016-D5P2.
